[
    {
        "version": "0.9.5-alpha",
        "changes": [
            "Fixed minor display and data handling issues across several modules."
        ]
    },
    {
        "version": "0.9.4-alpha",
        "changes": [
            "Fixed an issue where the admin was not able to view all club creation requests in the overview page.",
            "Extended notifications tab functionality to show club membership updates."
        ]
    },
    {
        "version": "0.9.3-alpha",
        "changes": [
            "Extended notifications tab functionality to show club creation request status."
        ]
    },
    {
        "version": "0.9.2-alpha",
        "changes": [
            "Email verification functionality has been implemented. New users now have to verify their email upon registration. Existing users have to ensure their email is verified by going to their Profile page.",
            "Updated the recommender engine."
        ]
    },
    {
        "version": "0.9.1-alpha",
        "changes": [
            "Updated the club joining function. Users who want to join a club will now need to first send a request which will be approved or rejected by a committee member or admin.",
            "The notifications tab was updated to show club join request status."
        ]
    },
    {
        "version": "0.9-alpha",
        "changes": [
            "Added functionality to view notifications. Integration with other modules coming soon."
        ]
    },
    {
        "version": "0.8.2-alpha",
        "changes": [
            "Fixed an issue where the system fails to initialise the academic progress tracker on first use."
        ]
    },
    {
        "version": "0.8-1-alpha",
        "changes": [
            "Refreshed the UI for the study partners suggester module views in smaller display sizes."
        ]
    },
    {
        "version": "0.8-alpha",
        "changes": [
            "Refreshed the website UI in most pages."
        ]
    },
    {
        "version": "0.7.2-alpha",
        "changes": [
            "The faculty member role now has the ability to request for club creation.",
            "Extended mailing functionality to provide notifications on club creation."
        ]
    }
]
